# GetGroupTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterDownloadOptions..::..GetGroupTypeId Method
ParameterDownloadOptions Class See Also
---
Get properties palette group identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ForgeTypeId GetGroupTypeId()
```

Visual Basic
---
```text
Public Function GetGroupTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetGroupTypeId()
```

# See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace